# Pandas Kütüphanesi

### Pandas kütüphanesi nedir?

Python'da veri analizi ve veri manipülasyonu için kullanılan bir kütüphanedir.

In [2]:
import pandas as pd

## Pandas Series

Tek boyutlu bir dizidir. (Exceldeki tek bir sütun gibi düşünebiliriz)

In [7]:
series1 = pd.Series([10,20,30,40,50])
series1

0    10
1    20
2    30
3    40
4    50
dtype: int64

## Pandas DataFrame (Tablo)

Birden fazla sütun içeren bir tablodur. (Excel dosyası)

In [8]:
data = {  "Ad": ["Ali","Ayşe","Mehmet","Zeynep"], "Yaş":[25,30,35,40], "Şehir":["İstanbul","Ankara","İzmir","Bursa"]  }
data

{'Ad': ['Ali', 'Ayşe', 'Mehmet', 'Zeynep'],
 'Yaş': [25, 30, 35, 40],
 'Şehir': ['İstanbul', 'Ankara', 'İzmir', 'Bursa']}

In [9]:
df1 = pd.DataFrame(data)
df1

       Ad  Yaş     Şehir
0     Ali   25  İstanbul
1    Ayşe   30    Ankara
2  Mehmet   35     İzmir
3  Zeynep   40     Bursa

In [14]:
type(series1)

pandas.core.series.Series

In [13]:
type(df1)

pandas.core.frame.DataFrame

In [15]:
df2 = pd.read_csv("Chocolate Sales.csv")
df2

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184
...,...,...,...,...,...,...
1089,Karlen McCaffrey,Australia,Spicy Special Slims,17-May-22,"$4,410",323
1090,Jehu Rudeforth,USA,White Choc,07-Jun-22,"$6,559",119
1091,Ches Bonnell,Canada,Organic Choco Syrup,26-Jul-22,$574,217
1092,Dotty Strutley,India,Eclairs,28-Jul-22,"$2,086",384
1093,Karlen McCaffrey,India,70% Dark Bites,23-May-22,"$5,075",344

In [16]:
# Sadece ilk 5 kayıt.
df2.head()

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",180
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184

In [17]:
# Sadece son 5 kayıt
df2.tail()

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
1089,Karlen McCaffrey,Australia,Spicy Special Slims,17-May-22,"$4,410",323
1090,Jehu Rudeforth,USA,White Choc,07-Jun-22,"$6,559",119
1091,Ches Bonnell,Canada,Organic Choco Syrup,26-Jul-22,$574,217
1092,Dotty Strutley,India,Eclairs,28-Jul-22,"$2,086",384
1093,Karlen McCaffrey,India,70% Dark Bites,23-May-22,"$5,075",344

In [18]:
df2["Amount"]

0        $5,320
1        $7,896
2        $4,501
3       $12,726
4       $13,685
          ...
1089     $4,410
1090     $6,559
1091       $574
1092     $2,086
1093     $5,075
Name: Amount, Length: 1094, dtype: object

In [20]:
df2[ df2["Boxes Shipped"] > 300 ]

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342
15,Beverie Moffet,Australia,Organic Choco Syrup,26-Jan-22,"$6,790",356
25,Karlen McCaffrey,India,Fruit & Nut Bars,26-Jan-22,$168,321
29,Dennison Crosswaite,New Zealand,Manuka Honey Choco,15-Jun-22,"$5,061",301
35,Roddy Speechley,USA,Manuka Honey Choco,22-Jul-22,"$9,583",315
...,...,...,...,...,...,...
1077,Oby Sorrel,Canada,Orange Choco,27-Apr-22,"$8,757",338
1083,Madelene Upcott,New Zealand,Milk Bars,29-Mar-22,"$12,558",403
1089,Karlen McCaffrey,Australia,Spicy Special Slims,17-May-22,"$4,410",323
1092,Dotty Strutley,India,Eclairs,28-Jul-22,"$2,086",384
1093,Karlen McCaffrey,India,70% Dark Bites,23-May-22,"$5,075",344

In [21]:
df2.isnull()

      Sales Person  Country  Product   Date  Amount  Boxes Shipped
0            False    False    False  False   False          False
1            False    False    False  False   False          False
2            False    False    False  False   False          False
3            False    False    False  False   False          False
4            False    False    False  False   False          False
...            ...      ...      ...    ...     ...            ...
1089         False    False    False  False   False          False
1090         False    False    False  False   False          False
1091         False    False    False  False   False          False
1092         False    False    False  False   False          False
1093         False    False    False  False   False          False

[1094 rows x 6 columns]

In [24]:
df2.isnull().any()

Sales Person     False
Country          False
Product          False
Date             False
Amount           False
Boxes Shipped    False
dtype: bool

In [25]:
df2.isnull().sum()

Sales Person     0
Country          0
Product          0
Date             0
Amount           0
Boxes Shipped    0
dtype: int64

In [2]:
df2 = pd.read_csv("Chocolate Sales.csv")
df2

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",NaN
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94.0
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91.0
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342.0
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184.0
...,...,...,...,...,...,...
1089,Karlen McCaffrey,Australia,Spicy Special Slims,17-May-22,"$4,410",323.0
1090,Jehu Rudeforth,USA,White Choc,07-Jun-22,"$6,559",119.0
1091,Ches Bonnell,Canada,Organic Choco Syrup,26-Jul-22,$574,217.0
1092,Dotty Strutley,India,Eclairs,28-Jul-22,"$2,086",384.0
1093,Karlen McCaffrey,India,70% Dark Bites,23-May-22,"$5,075",344.0

In [29]:
df2.isnull()

      Sales Person  Country  Product   Date  Amount  Boxes Shipped
0            False    False    False  False   False           True
1            False    False    False  False   False          False
2            False    False    False  False   False          False
3            False    False    False  False   False          False
4            False    False    False  False   False          False
...            ...      ...      ...    ...     ...            ...
1089         False    False    False  False   False          False
1090         False    False    False  False   False          False
1091         False    False    False  False   False          False
1092         False    False    False  False   False          False
1093         False    False    False  False   False          False

[1094 rows x 6 columns]

In [30]:
df2.isnull().any()

Sales Person     False
Country          False
Product           True
Date              True
Amount            True
Boxes Shipped     True
dtype: bool

In [31]:
df2.isnull().sum()

Sales Person     0
Country          0
Product          1
Date             1
Amount           2
Boxes Shipped    3
dtype: int64

In [32]:
df2.fillna(0, inplace=True)

In [3]:
df2.isnull().any()

Sales Person     False
Country          False
Product           True
Date              True
Amount            True
Boxes Shipped     True
dtype: bool

In [34]:
df2

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",0.0
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94.0
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91.0
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342.0
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184.0
...,...,...,...,...,...,...
1089,Karlen McCaffrey,Australia,Spicy Special Slims,17-May-22,"$4,410",323.0
1090,Jehu Rudeforth,USA,White Choc,07-Jun-22,"$6,559",119.0
1091,Ches Bonnell,Canada,Organic Choco Syrup,26-Jul-22,$574,217.0
1092,Dotty Strutley,India,Eclairs,28-Jul-22,"$2,086",384.0
1093,Karlen McCaffrey,India,70% Dark Bites,23-May-22,"$5,075",344.0

## Pandas kütüphanesinde 10 adet fonksiyon araştırılıp kullanım örneği olan bir ipynb dosyası ile paylaşılacak.

In [3]:
df3 = pd.read_csv("Chocolate Sales2.csv")
df3.isnull().sum()

Sales Person     0
Country          6
Product          6
Date             6
Amount           6
Boxes Shipped    6
dtype: int64

In [4]:
df3.head(5)

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",NaN
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94.0
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91.0
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342.0
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184.0

In [5]:
df3["Boxes Shipped"].mean()

np.float64(162.10110294117646)

In [6]:
#df3["Boxes Shipped"].fillna( df3["Boxes Shipped"].mean(), inplace=True )
df3["Boxes Shipped"] = df3["Boxes Shipped"].fillna( df3["Boxes Shipped"].mean() )

In [32]:
df3.isnull().sum()

Sales Person     0
Country          6
Product          6
Date             6
Amount           6
Boxes Shipped    0
dtype: int64

In [16]:
df3.head(5)

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04-Jan-22,"$5,320",162.101103
1,Van Tuxwell,India,85% Dark Bars,01-Aug-22,"$7,896",94.000000
2,Gigi Bohling,India,Peanut Butter Cubes,07-Jul-22,"$4,501",91.000000
3,Jan Morforth,Australia,Peanut Butter Cubes,27-Apr-22,"$12,726",342.000000
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24-Feb-22,"$13,685",184.000000

In [18]:
df3["Amount"]

0        $5,320
1        $7,896
2        $4,501
3       $12,726
4       $13,685
          ...
1089     $4,410
1090     $6,559
1091       $574
1092     $2,086
1093     $5,075
Name: Amount, Length: 1094, dtype: object

In [7]:
# $5,320 -> 5320.00
# Önce formatı düzenle!
# obj->float
df3["Amount"] = df3["Amount"].astype(str).str.replace("[$,]", "",regex=True).replace("","0")
df3["Amount"]
#df3["Amount"].mean()

0        5320
1        7896
2        4501
3       12726
4       13685
         ...
1089     4410
1090     6559
1091      574
1092     2086
1093     5075
Name: Amount, Length: 1094, dtype: object

In [8]:
df3["Amount"] = (  pd.to_numeric(df3["Amount"], errors="coerce")  )

In [9]:
df3["Amount"]

0        5320.0
1        7896.0
2        4501.0
3       12726.0
4       13685.0
         ...
1089     4410.0
1090     6559.0
1091      574.0
1092     2086.0
1093     5075.0
Name: Amount, Length: 1094, dtype: float64

In [12]:
df3.isnull().sum()

Sales Person     0
Country          6
Product          6
Date             6
Amount           0
Boxes Shipped    0
dtype: int64

In [11]:
df3["Amount"] = df3['Amount'].fillna( df3['Amount'].mean() )

In [16]:
df3["Date"] = df3['Date'].ffill().bfill()

In [24]:
df3.isnull().sum()

Sales Person     0
Country          0
Product          6
Date             0
Amount           0
Boxes Shipped    0
dtype: int64

In [22]:
df3["Country"].mode()[0]

'Australia'

In [23]:
df3["Country"].fillna( df3['Country'].mode()[0], inplace=True )

C:\Users\PC1\AppData\Local\Temp\ipykernel_36220\1379354516.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df3["Country"].fillna( df3['Country'].mode()[0], inplace=True )

In [32]:
## Productu doldururken: Her bir "Sales Person" için boş ürünü, o kişinin en çok sattığı ürün ile doldurunuz.
df3["Product"].mode()

0    Eclairs
Name: Product, dtype: object

In [27]:
data = {
    "Product": ["A", "B", "A", "B", "A", "C", "C"],
    "Amount": [100, 200, 150, 250, None, 300, None]
}
df4 = pd.DataFrame(data)
df4

  Product  Amount
0       A   100.0
1       B   200.0
2       A   150.0
3       B   250.0
4       A     NaN
5       C   300.0
6       C     NaN

In [28]:
df4["Amount"].mean()

np.float64(200.0)

In [31]:
#DataFrame -> GroupBy
df4.groupby("Product")["Amount"].mean()

Product
A    125.0
B    225.0
C    300.0
Name: Amount, dtype: float64